/*
От 1 до 10
Вывести на экран числа от 1 до 10 используя цикл while. Каждое значение с новой строки.
 */

package level_04;

public class task0430 {
    public static void main (String []args) {
        int i = 1;
        while(i < 11){
            System.out.println(i);
            i++;
        }
    }
}
