/*
Гадание на долларовый счет
Вывести на экран квадрат из 10х10 букв S используя цикл while.
Буквы в каждой строке не разделять.
Пример вывода на экран:
SSSSSSSSSS
SSSSSSSSSS
SSSSSSSSSS
SSSSSSSSSS
SSSSSSSSSS
SSSSSSSSSS
SSSSSSSSSS
SSSSSSSSSS
SSSSSSSSSS
SSSSSSSSSS
 */

package level_04;

public class task0433 {
    public static void main (String []args)throws Exception {
        int i = 0;
        while(i++ < 10){ System.out.println("SSSSSSSSSS");}
    }
}
