/*
Любимое стихотворение
В методе main напиши код, чтобы в результате выполнения программы было выведено твое любимое стихотворение.
В стихотворении должно быть не меньше, чем 4 строчки. Не убирай вывод строчки «Мое любимое стихотворение:».
Требования:
1. Программа должна выводить текст.
2. Перед стихом должна быть выведена строка "Мое любимое стихотворение:".
3. Выводимый текст должен состоять не меньше, чем из пяти строк (пустые строки - это тоже строки).
4. В выводимом тексте должно быть не менее, чем 50 символов.
 */

package level_01;

public class task0138 {
    public static void main(String[] args) {
        System.out.println("Мое любимое стихотворение:");
        System.out.println("");
        System.out.println("Играют волны — ветер свищет,");
        System.out.println("И мачта гнется и скрыпит...");
        System.out.println("Увы! Он счастия не ищет");
        System.out.println("И не от счастия бежит!");
    }
}
