/*
Баги и фичи
Напиши программу, которая выводит на экран надпись «Это не баг, это фича.»
Пример вывода на экран:
Это не баг, это фича.

Требования:
1. Программа должна выводить текст.
2. Текст должен начинаться с «Это не баг».
3. Текст должен заканчиваться точкой.
4. Текст должен состоять из 21 символа, включая пробелы и знаки препинания.
5. Выводимый текст должен соответствовать заданию.
 */

package level_00;

public class task0106 {
    public static void main(String[]args){
        System.out.print("Это не баг, это фича.");
    }
}
