/*
Не хочешь - решай нехотя
Напиши программу, которая выводит на экран надпись: «Хочешь - решай задачи, не хочешь - решай нехотя» 16 раз.
Требования:
1. Программа должна выводить текст.
2. Текст должен начинаться с «Хочешь».
3. Текст должен заканчиваться на «нехотя».
4. Текст должен состоять из 16 строк.
5. Выводимый текст должен соответствовать заданию.
 */

package level_01;

public class task0126 {
    public static void main(String[] args) {
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");

        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");

        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");

        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
        System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
    }
}
