/*
Еще немного исправлений
Внеси изменения в программу, чтобы выводился на экран текст: «Coding in java».
Используй переменные.
Требования:
1. Должно быть объявлено 3 переменных.
2. Всем переменным должны быть присвоены значение сразу после создания.
3. Команду вывода текста на экран изменять нельзя.
4. Программа должна выводить текст "Coding in java".
 */

package level_01;

public class task0117 {
    public static void main(String[] args) {
        String s1 = "Coding";
        String s2 = "in";
        String s3 = "java";
        System.out.println(s1 + " " + s2 + " " + s3);
    }
}
