/*
Я так давно родился
Вывести на экран дату своего рождения в виде: MAY 1 2012
 */

package level_03;

public class task0305 {
    public static void main(String[] args)
    {
        System.out.println("MAY 1 1997");
    }
}
